package com.gmail.petrikov05.SimpleWeb.bot.constant;

public interface MessagePriceConstant {

    String PRICE_TITLE_ONE = "ИП";
    String PRICE_TITLE_TWO = "Предприятие";

    String PRICE_ONE_SUBTITLE_ONE = "Единый налог.";
    String PRICE_ONE_SUBTITLE_TWO = "Стартапы.";
    String PRICE_ONE_SUBTITLE_THREE = "До 30 первичных учетных документов.";
    String PRICE_ONE_SUBTITLE_FOUR = "От 50 и выше первичных документов.";

    String PRICE_ONE_SUBTITLE_ONE_MESSAGE = "От 150 руб.";
    String PRICE_ONE_SUBTITLE_TWO_MESSAGE = "Только для тех, кто начинает свой Бизнес! (первый месяц).\n" +
            "- Документооборот - до 30 первичных документов в месяц\n" +
            "- Консультации по бухгалтерским вопросам\n" +
            "Стоимость: УСН от 100 руб. ПН от 100 руб.";
    String PRICE_ONE_SUBTITLE_THREE_MESSAGE = "- Обработка первичных документов\n" +
            "- Расчет заработной платы \n" +
            "- Подготовка и подача отчетности\n" +
            "- Консультирование в рамках деятельности\n" +
            "- Курьерская служба\n" +
            "Стоимость: УСН от 250 руб. ПН от 200 руб.";
    String PRICE_ONE_SUBTITLE_FOUR_MESSAGE = "- Обработка первичных документов\n" +
            "- Расчет заработной платы\n" +
            "- Подготовка и подача отчетности\n" +
            "- Консультирование в рамках деятельности\n" +
            "- Курьерская служба\n" +
            "Стоимость: УСН от 300 руб. ОСН от 400 руб.";

    String PRICE_TWO_SUBTITLE_ONE = "Стартапы.";
    String PRICE_TWO_SUBTITLE_TWO = " До 30 первичных учетных документов.";
    String PRICE_TWO_SUBTITLE_THREE = "До 50 первичных учетных документов.";
    String PRICE_TWO_SUBTITLE_FOUR = "До 100 первичных учетных документов.";
    String PRICE_TWO_SUBTITLE_FIVE = "Только функции главного бухгалтера.";

    String PRICE_TWO_SUBTITLE_ONE_MESSAGE = "Только для тех, кто начинает свой Бизнес! (первый месяц).\n" +
            "- Наемных сотрудников - до 5 человек\n" +
            "- Документооборот - до 30 первичных документов в месяц\n" +
            "- Консультации по бухгалтерским вопросам\n" +
            "- Отчет о финансовых результатах\n" +
            "Стоимость: УСН от 100 руб. ОСН от 150 руб.";
    String PRICE_TWO_SUBTITLE_TWO_MESSAGE = "- Обработка первичных документов\n" +
            "- Расчет заработной платы (5 чел.)\n" +
            "- Подготовка и подача отчетности\n" +
            "- Консультирование в рамках деятельности\n" +
            "- Курьерская служба\n" +
            "- Отчет о финансовых результатах\n" +
            "Стоимость: УСН от 200 руб. ОСН от 250 руб.";
    String PRICE_TWO_SUBTITLE_THREE_MESSAGE = "- Обработка первичных документов\n" +
            "- Расчет заработной платы (5 чел.)\n" +
            "- Подготовка и подача отчетности\n" +
            "- Консультирование в рамках деятельности\n" +
            "- Курьерская служба\n" +
            "- Отчет о финансовых результатах\n" +
            "Стоимость: УСН от 250 руб. ОСН от 350 руб.";
    String PRICE_TWO_SUBTITLE_FOUR_MESSAGE = "- Обработка первичных документов\n" +
            "- Расчет заработной платы (5 чел.)\n" +
            "- Подготовка и подача отчетности\n" +
            "- Консультирование в рамках деятельности\n" +
            "- Курьерская служба\n" +
            "- Отчет о финансовых результатах\n" +
            "Стоимость: УСН от 400 руб. ОСН от 500 руб.";
    String PRICE_TWO_SUBTITLE_FIVE_MESSAGE = "- Проверка разнесения документов\n" +
            "- Расчет заработной платы (5 чел.)\n" +
            "- Подготовка и подача отчетности\n" +
            "- Консультирование в рамках деятельности\n" +
            "- Курьерская служба\n" +
            "- Отчет о финансовых результатах\n" +
            "Стоимость: от 350 руб.";

}
