package com.gmail.petrikov05.SimpleWeb.bot.constant;

public interface MessageConstant {

    String MESSAGE_FOR_COMMAND_START = "Shnarkevich.by к Вашим услугам. Бот-консультант рад с Вами пообщаться.";
    String MESSAGE_FOR_WRONG_COMMAND = "I don't know this command. I only know command: /start and /help";
    String MESSAGE_FOR_COMMAND_HELP = "Use command /start";

    String MESSAGE_WANT_BOT = "Главным преимуществом нашего бота является его легкое управление. Купив бота, Вы автоматически получаете доступ к сайту с его управлением. И уже сами можете менять структуру бота (менять клавиши), добавлять и убирать информацию. Конечно, если Вы захотите оформить подписку (ежемесячное обслуживание), мы Вам не откажем.\n" +
            "Чат-бот разрабатывается по Вашей структуре и будет выполнять функции, заданные Вами, он будет уникальным. Если структура бота, который Вы хотите создать похожа на тот в котором Вы находитесь, то ориентировочная стоимость 100 руб.\n";
//            "Для связи с нами используйте клавишу «Написать»";

}
