package com.gmail.petrikov05.SimpleWeb.bot.constant;

public interface MessageFaqConstant {

    String TITLE_FAQ_ONE = "Кому нужно использовать электронные накладные.";
    String TITLE_FAQ_TWO = "Основные изменения в проект НК 2022 для юр. лиц.";
    String TITLE_FAQ_THREE = "Что относится к товарам прослеживаемости?";
    String TITLE_FAQ_FOUR = "Можно ли использовать для выезда за границу ID – карту?";

    String MESSAGE_FAQ_ONE = "Электронные накладные нужны при обороте:\n" +
            "1) товаров, маркированных незащищенными средствами идентификации (СИ) (п. 3 Положения о маркировке товаров средствами идентификации N 243 );\n" +
            "2) товаров, подлежащих прослеживаемости (п. 14 Положения N 496 ).";
    String MESSAGE_FAQ_TWO = " Проект НК 2022 предполагает:\n" +
            "- снижение критериев для примениния УСН;\n" +
            "- отмена УСН с НДС (только без);\n" +
            "- налог при УСН исчисляется кассовым принципом (по оплате), полученные авансы тоже учитываются как выручка;\n" +
            "- ставка налога при УСН 6% от валовой выручки и 16% от внереализационных доходов;\n" +
            "- отмена УСН для ИП, оказывающих услуги, кроме туристической деятельности, деятельности в сфере здравоохранения, деятельности сухопутного транспорта, услуг по общественному питанию, деятельности по техническому обслуживанию и ремонту автомобилей и (или) мотоциклов;\n" +
            "- с 1 января 2023 года для ИП исключается возможность применения УСН;\n" +
            "- единый налог с физлиц в сохранен до 1 января 2023 года;\n" +
            "- с 1 января 2023 года вводится новый налог на профессиональный доход. Плательщиками этого налога признаются физические лица;\n" +
            "- планируется снизить до 460000 руб. критерий выручки в целях признания ИП на ОСН плательщиками НДС.\n" +
            "И многое другое.";
    String MESSAGE_FAQ_THREE = "В Республике Беларусь с 1 декабря 2021 г. вводится прослеживаемость в отношении двух товарных групп:\n" +
            "- холодильники и морозильники бытовые;\n" +
            "- шины и покрышки пневматические резиновые новые.";
    String MESSAGE_FAQ_FOUR = "Нет. Только биометрический паспорт (или действующий беларуский паспорт). Но, чтобы оформить биометрический паспорт, нужно в обязательном порядке сначала сделать ID-карту.";

}
